{
  "date": "Tuesday July 28th, 2020",
  "dateshort": "July 28th",
  "body": "Partials in SASS help us to break up our files into smaller files without affecting performance.\n\nThe use of partials allows us to modularize our CSS, to help keep things maintainable.\n\nWe divide up our Sass into separate files representing different components. A partials’ name will always start with an underscore `_`. We then import the partial using an `@import` directive.\n\n## Using Partials\n\nLet’s say our Sass file is getting rather large. We might choose to make a partial file that contains just the code that’s relevant to the header section; we’d call it `_header.scss` and move the appropriate code into that new file.\n\nWe would then import it back into `main.css`, like so:\n\n```SASS\n// In main.scss\n@import 'header';\n```\n\n*Note:* When you import a file, there’s no need to include the `_` or `.scss` file extension.\n\n## @import in CSS vs SASS [](https://www.educative.io/pageeditor/5200180308606976/5033336129978368/6705841861296128#import-in-css-vs-sass)\n\nThe `@import` directive is of course, also available in CSS. However, there is an important difference. Whenever an import statement is used in CSS, an HTTP request is made to the server. This increases the amount of resource requests and negatively affects the performance of a web page. SASS does not do that. SASS takes the file that you want to import from and combines it with the file you’re importing. So you can serve a single CSS file to the web browser, which does not affect the performance.\n\nIn the next post in this series, we’ll be looking at how to implement inheritance with `extends`.\n\n## Related Posts:\n\n* [An Introduction to SASS](https://www.easeout.co/blog/2020-07-07-an-introduction-to-sass)\n* [Setting up SASS](https://www.easeout.co/blog/2020-07-09-setting-up-sass)\n* [Using SASS Variables](https://www.easeout.co/blog/2020-07-14-using-sass-variables)",
  "title": "SASS Partials & Importing",
  "description": "Learn how partials & importing works in SASS.",
  "short": "Learn how partials & importing works in SASS.",
  "category": "SASS",
  "thumbnail": "/images/uploads/sass-partials-importing-min.png"
}