{
  "date": "Tuesday July 14th, 2020",
  "dateshort": "July 14th",
  "body": "SASS effectively gives us a lot of the programmatic benefits of working with code, only now with the ability to apply it to stylesheets.\n\nOver the next few posts we’ll be diving right into the features of SASS.\n\nFirst up let’s introduce **variables**.\n\n## Definition\n\n**Variables** are a way to store information that you want to reuse throughout your stylesheet.\n\nThey allow us to store values for colors, fonts or really any CSS value that you want to reuse!\n\nWe use the `$` symbol when we wish to make something a variable.\n\n## Example\n\nIn our SCSS, let’s define a color variable:\n\n```SASS\n$color-primary: #ffff00; // Yellow\n \nbody {\n  background-color: $color-primary;\n}\n```\n\nThis will of course, set our `background-color` to yellow. It’s that simple!\n\n*Note:* You can use single line comments in Sass with `//`.\n\nWhen we then run our compile, it’ll output the following CSS:\n\n```SASS\nbody {\n  color: #ffff00;\n}\n```\n\nNote: We'll be covering the compilation process further on in this series. For now it’s good to know that when we save our code into `sass/main.scss`, it’ll automatically compile into the `css/style.css` file!\n\nThis becomes extremely powerful when working on large projects!\n\nIf you wish to make a change to a colour used throughout your stylesheets, it’s much simpler to alter if the color is defined in one location as a single variable.\n\nThe alternative to changing the value of one variable defined at one location is finding and replacing every reference to the value you want to change. This is a much more tedious task, especially if you want to implement a quick change to test out a different color or font.\n\n## Related Posts:\n\n* [An Introduction to SASS](https://www.easeout.co/blog/2020-07-07-an-introduction-to-sass)\n* [Setting up SASS](https://www.easeout.co/blog/2020-07-09-setting-up-sass)",
  "title": "Using SASS Variables",
  "description": "An introduction to using variables with SASS.",
  "short": "An introduction to using variables with SASS.",
  "category": "SASS",
  "thumbnail": "/images/uploads/sass-variables-min.png"
}