{
  "date": "Wednesday April 29th, 2020",
  "dateshort": "April 29th",
  "body": "The landing page is undoubtedly one of the most important pages on any website. It provides the initial impression, sets the tone & potentially drives the user to action. Effective landing pages encourage visitors to stay and explore, and go a long way toward converting visitors into customers.\n\nIf you're looking to establish a web presence for a startup or side project, using a free landing page template is a great option. You don't need design or coding skills, and in no time at all you'll have a beautiful & effective landing page to call your own.\n\nSo without further ado, here are 50 free landing page templates for 2020!\n\nAll are pure HTML (not tied to a CMS), free & ready to go!\n\n## 1. Venus\n\n![Venus Landing Page](/images/uploads/venus.jpg)\n\nVenus is a highly animated one page landing page template perfect for apps. It's fully responsive & customizable with editable placeholders & color palette options.\n\n[See the demo](https://cruip.com/demos/solid/)\n\n## 2. Leno\n\n![Leno Landing Template](/images/uploads/leno.jpg)\n\nLeno is a dark mobile app HTML landing page with a plethora of eye-catching features. Including an image slider with a large preview for placeholders, a dynamic carousel for customer testimonials, and a set of useful additional pages.\n\n[See more details](https://htmlrev.com/leno-mobile-app-landing-page-html-template-41)\n\n## 3. Leon\n\n![Leon Landing Template](/images/uploads/leon-landing.png)\n\nLeon is a mobile app website Bootstrap HTML template with a dark style designed to promote mobile apps to the online audience and make visitors download them from the popular app stores.\n\n[See more details](https://htmlrev.com/leon-mobile-app-landing-page-html-template-38)\n\n## 4. Avid\n\n![Avid Landing Template](/images/uploads/avid-landing.png)\n\nAvid is a SaaS app website Bootstrap HTML template with a dark style built to help you create beautiful and efficient online presentations for your web apps and convince visitors to sign up for them.\n\n[See more details](https://htmlrev.com/avid-saas-app-landing-page-html-template-48)\n\n## 5. Solid\n\n![Solid Landing Template](/images/uploads/solid.jpg)\n\nSolid is a one-page landing template perfect for online tools, SaaS products, and digital services. Featuring a sleek dark look & 3D icons/illustrations.\n\n[See the demo](https://cruip.com/demos/solid/)\n\n## 6. Parason\n\n![Parason Landing Template](/images/uploads/parason.png)\n\nParason is great for SaaS, business, mobile and web applications. Featuring call-to-action buttons strategically placed across the design, sticky navigation, pricing plans, testimonials, forms and google maps.\n\n[See the demo](https://colorlib.com/preview/#parason)\n\n## 7. Tivo\n\n![Tivo Landing Template](/images/uploads/tivo-landing.jpg)\n\nTivo is great for SaaS websites & B2C application pages. Featuring a simple dropdown navigation, article details, video box & text slider testimonials.\n\n[See more details](https://htmlrev.com/tivo-saas-app-landing-page-html-template-50)\n\n## 8. Marshmallow\n\n![Marshmallow Landing Template](/images/uploads/marshmallow.jpg)\n\nMarshmallow has been designed for SaaS products, startups, and application showcases. Featuring beautifully designed elements which make your website look and feel secure and professional.\n\n[See the demo](https://www.bootstrapdash.com/demo/marshmallow/)\n\n## 9. Crafted\n\n![Crafted Landing Template](/images/uploads/crafted.png)\n\nCrafted is perfect if you offer creative web design and development services. Featuring an about, services, projects and team page. As well as a blog, contact form and Google Maps integration.\n\n[See the demo](https://colorlib.com/preview/#crafted)\n\n## 10. Laurel\n\n![Laurel Landing Template](/images/uploads/laurel.jpg)\n\nLaurel is a lovely showcase for your mobile application. The template is handy for developers in that it comes with the Sass files, NPM scripts as the build tool, and the package.json sample file. For the design, all assets are built to offer endless customization options.\n\n[See the demo](https://cruip.com/demos/laurel/)\n\n## 11. Evolo\n\n![Evolo Landing Template](/images/uploads/evolo.jpg)\n\nEvolo is perfect for online services and digital products. Featuring a collection of supporting elements that can be integrated to add pages or build a completely new website with convenience.\n\n[See more details](https://htmlrev.com/evolo-startup-landing-page-html-template-23)\n\n## 12. Appland\n\n![Appland Landing Template](/images/uploads/appland.jpg)\n\nAppland is another fantastic starter template for application landings. Featuring an original design and all the necessary elements a startup needs to build compelling landing pages!\n\n[See the demo](https://uideck.com/templates/appland/)\n\n## 13. Sierra\n\n![Sierra Landing Template](/images/uploads/sierra.png)\n\nThe Sierra startup template is fully responsive and retina ready. It is packed with a multitude of features which you can use to get your business online fast!\n\n[See the demo](https://colorlib.com/preview/#sierra)\n\n## 14. Gaas\n\n![Gaas Landing Template](/images/uploads/gaas.jpg)\n\nWith a light, yet vibrant, and fully responsive layout, Gaas makes sure your users are hooked immediately regardless of what device they use.\n\n[See the demo](https://colorlib.com/preview/#gaas)\n\n## 15. Atlas\n\n![Atlas Landing Template](/images/uploads/atlas.jpg)\n\nAtlas is a responsive and highly customisable landing page offering numerous features! It's a great option if you wish to promote a SaaS product.\n\n[See the demo](https://www.lapa.ninja/lab/atlas/)\n\n## 16. Fancy\n\n![Fancy Landing Template](/images/uploads/fancy.png)\n\nFancy is a professional looking creative business website template for medium and small businesses in any industry. It comes with a well designed and feature rich front page as well as blog & looks stunning on any mobile device.\n\n[See the demo](https://colorlib.com/preview/#fancy)\n\n## 17. Drimo\n\n![Drimo Landing Template](/images/uploads/drimo.jpg)\n\nDrimo works well with hosting, mobile app, SaaS, repairing and gadget websites. It also includes eleven contemporary one-page layouts for all sorts of products and services.\n\n[See the demo](https://colorlib.com/preview/#drimo)\n\n## 18. Raptor\n\n![Raptor Landing Template](/images/uploads/raptor.png)\n\nRaptor is a professional, contemporary and neatly designed template packed full of quality assets. Featuring a striking filtered gradient.\n\n[See the demo](https://colorlib.com/preview/#raptor)\n\n## 19. April\n\n![April Landing Template](/images/uploads/april.jpg)\n\nApril has smooth navigation, neat sections for displaying app features, customer testimonials and product previews.\n\n[See the demo](https://cruip.com/demos/april/)\n\n## 20. Switch\n\n![Switch Landing Template](/images/uploads/switch.jpg)\n\nFeaturing a hero toggle allowing you to switch between light and dark mode, this one-page template will definitely wow your users. Plus the subtle animations are a nice touch!\n\n[See the demo](https://cruip.com/demos/switch/)\n\n## 21. Edumark\n\n![Edumark Landing Template](/images/uploads/edumark.png)\n\nEdumark is a fantastic solution for a striking web presence. Featuring a full-screen banner, call-to-action buttons, drop-down menu, sticky navigation, filterable courses portfolio, testimonials, a newsletter subscription form, blog pages and a contact section.\n\n[See the demo](https://colorlib.com/preview/#edumark)\n\n## 22. Kairos\n\n![Kairos Landing Template](/images/uploads/kairos.jpg)\n\nKairos is a delightful app template. Designed with UX in mind to let your customers discover more about the features your app provides, plus a benefits section leading into the contact form call-to-action. Kairos uses smooth transitions to give your landing a more natural look and feel.\n\n[See the demo](https://templatemag.com/demo/templates/CleanLanding/index.html)\n\n## 23. Dazzle\n\n![Dazzle Landing Template](/images/uploads/dazzle.jpg)\n\nDazzle features a strong a parallax scrolling layout which offers smooth appearances and unlimited customization possibilities. It is a visually appealing one page for nearly every possible occasion.\n\n[See the demo](https://demos.onepagelove.com/html/dazzle/)\n\n## 24. Landing\n\n![Landing Template Design](/images/uploads/landing.jpg)\n\nLanding is a modern SaaS landing template with a smooth user experience to make your site stand out from the crowd. And as a bonus, all the images from Landing can be used for personal or commercial projects!\n\n[See the demo](https://www.tailwindtoolbox.com/templates/landing-page-demo.php)\n\n## 25. Multipurpose\n\n![Multipurpose Landing Template](/images/uploads/multipurpose-bootstrap-theme.jpg)\n\nThis multi-purpose Bootstrap kit features a number of templates. All are fully responsive with subtle animations and use of parallax effects.\n\n[See the demo](https://keenthemes.com/preview/megakit/index.html)\n\n## 26. Basic\n\n![Basic Landing Template Theme](/images/uploads/basic.jpg)\n\nBasic is a software and SaaS landing template developed with Bootstrap 4. It's fully responsive & ready for your customization!\n\n[See the demo](https://preview.uideck.com/items/basic/)\n\n## 27. SaaS Subscription\n\n![SaaS Subscription Landing Template](/images/uploads/shades-saas-cta.jpg)\n\nSaaS subscription is the perfect HTML landing page template with a strong call-to-action to acquire new users and converts visitors into potential customers. The template features several nice graphics and pre-built sections, and it’s easily editable.\n\n[See the demo](https://grayic.com/preview/?demo=saas-sub)\n\n## 28. Eclipse\n\n![Eclipse Landing Template](/images/uploads/eclipse.png)\n\nEclipse is great for online courses & even school, college or university pages. Its has a sleek modern design, to help you win over your users.\n\n[See the demo](https://colorlib.com/preview/#eclipse)\n\n## 29. Software\n\n![Berlin Software Landing Template](/images/uploads/berlin-software.jpg)\n\nThe Berlin Software app template has been built for SaaS projects and product conversion pages. Including several table options & a section for video presentations.\n\n[See the demo](https://grayic.com/preview/?demo=software)\n\n## 30. Startup\n\n![Startup Landing Page Template](/images/uploads/startup2.png)\n\nStartup works across all devices and platforms without a hitch. Along with the nifty home page, it includes plenty of ready-to-use elements.\n\n[See the demo](https://colorlib.com/preview/#startup2)\n\n## 31. Ellie\n\n![Ellie Landing Template](/images/uploads/ellie.jpg)\n\nEllie is a beautiful dark, bright, and compact free template. Featuring top hero animations and pixel-perfect shapes, you will never have visitors bouncing before scrolling to the body section again.\n\n[See the demo](https://cruip.com/demos/ellie/)\n\n## 32. Slick\n\n![Slick Landing Template](/images/uploads/slick.jpg)\n\nSlick is a multi-purpose web template based on Bootstrap 4. It was designed with best UI/UX practices to provide an excellent experience on any kind of digital device. It comes with two different homepage variations for web-based software products and mobile applications.\n\n[See the demo](https://preview.uideck.com/items/slick/business/index.html)\n\n## 33. SaaS Application\n\n![Shades SaaS Landing Template](/images/uploads/shades-saas.jpg)\n\nSaaS application is a Bootstrap 4 landing template with a delightful color scheme. Featuring fun illustrations, modern icons, pricing components, and a text form call-to-action.\n\n[See the demo](https://grayic.com/preview/?demo=saas-app)\n\n## 34. Web Application\n\n![Shades Web App Template](/images/uploads/shades-app.jpg)\n\nShades' Web Application web application template is great for web or desktop apps. Featuring some very engaging call to actions. This template will help you build an attractive standalone page for a variety of needs.\n\n[See the demo](https://grayic.com/preview/?demo=web-app)\n\n## 35. Knight\n\n![Knight Landing Page Template](/images/uploads/knight.jpg)\n\nKnight is a dark, modern, and elegant Bootstrap 4 landing template. Featuring Font Awesome icons, slick slider, an FAQ list, and more. \n\n[See the demo](https://webresourcesdepot.com/demo/knight/)\n\n## 36. Online Course\n\n![Online Course Landing Template](/images/uploads/shades-course.jpg)\n\nOnline Course is a free template for creating and selling online courses. Featuring ready to access online classes, video lessons, and review systems.\n\n[See the demo](https://grayic.com/preview/?demo=online-course)\n\n## 37. Union\n\n![Union Landing Page Template](/images/uploads/union.jpg)\n\nUnion comes with over 10 different color schemes, as well as Sass component files (for easy customization). It's ideal for a quick setup & launch! \n\n[See the demo](https://webresourcesdepot.com/demo/union/)\n\n## 38. Mobile App by Berlin\n\n![Berlin Mobile App Landing Template](/images/uploads/berlin-app.jpg)\n\nMobile App 2.0 is ideal for mobile apps, startups and digital businesses. Featuring a clean layout & easy setup process.\n\n[See the demo](https://grayic.com/preview/?demo=mobile-app-2-0)\n\n## 39. Simple\n\n![Simple Landing Template](/images/uploads/simple.jpg)\n\nSimple is a one page landing page template ideal for online services & digital products. Featuring human illustrations, pixel perfect icons, and a set of pre-built elements for easy customization.\n\n[See the demo](https://www.bootstrapdash.com/demo/simple/)\n\n## 40. Phantom\n\n![Phantom Landing Template](/images/uploads/phantom.jpg)\n\nPhantom is a template for developers looking for a clean landing page for their side projects, The layout is perfect for selling browser extensions, however it can easily be adapted to suit your requirements.\n\n[See the demo](https://webresourcesdepot.com/demo/phantom/)\n\n## 41. Nova\n\n![Nova Landing Template](/images/uploads/nova.jpg)\n\nNova is a professional mobile app landing page built with Bootstrap 4. It has a fresh minimal look with lots of customization options.\n\n[See the demo](https://demo.bootstraptemple.com/app-landing/)\n\n## 42. Snap\n\n![Snap Landing Template](/images/uploads/snap.jpg)\n\nSnap is a landing page perfect for a utility application. Features include pricing tabs, support section, desktop placeholders, benefit tiles, and a carousel to display user reviews.\n\n[See the demo](https://webresourcesdepot.com/demo/snap/)\n\n## 43. Digital Service\n\n![Digital Service Template](/images/uploads/shades-digital-services.jpg)\n\nDigital service is a landing page for your mobile app. It's based on Bootstrap 4, featuring a variety of pre-designed parts such as masonry testimonials, pricing table, input forms, three-column feature section, and many more. \n\n[See the demo](https://grayic.com/preview/?demo=digital-service)\n\n## 44. Quick\n\n![Quick Landing Template](/images/uploads/quick.jpg)\n\nQuick is an HTML landing page built for mobile-first projects, startups, and digital services. This template includes 50+ pre-built components, 2 useful plugins, and 4 nicely designed responsive pages. \n\n[See the demo](http://themehunt.com/item/1527640-quick-free-bootstrap-4-theme/preview)\n\n## 45. devAid\n\n![devAid Landing Templates](/images/uploads/devaid.jpg)\n\ndevAid is ideal for developers looking to showcase their side projects. The template comes with multiple color options, source SCSS files to easily perform styling customization.\n\n[See the demo](https://themes.3rdwavemedia.com/demo/devaid/)\n\n## 46. The SEO Company\n\n![SEO Company Landing Template](/images/uploads/seocompany.jpg)\n\nThe SEO Company is a template for digital teams looking to sell online services. Featuring attractive transitions, mobile touch sliders, and a well mixed set of advanced elements to maximize conversion rates.\n\n[See the demo](https://demos.onepagelove.com/html/seo-company/)\n\n## 47. Start Bootstrap Landing Page\n\n![Start Bootstrap Landing Page](/images/uploads/startbootstrap.jpg)\n\nBuilt with Bootstrap 4, this landing page makes it easy to establish a web presence. Featuring an input form opt-in header with responsive background image, and several generous content sections to showcase functionalities and benefits.\n\n[See the demo](https://startbootstrap.com/previews/landing-page/)\n\n## 48. Coming Soon\n\n![Coming Soon Landing Template](/images/uploads/comingsoon.jpg)\n\nWith this template you can build pre-launch landing page with ease. It is designed to be multi-purpose, so you don’t need heavy customization to adapt the content to suit your needs.\n\n[See the demo](https://startbootstrap.com/previews/coming-soon/)\n\n## 49. Dev Space\n\n![Dev Space Landing Page](/images/uploads/devspace.jpg)\n\nDev Space is a beautifully designed template for app development consultant services. Featuring several free streamline icons, a generous illustration pack, and a well-documented code written with efficiency and easy to maintain.\n\n[See the demo](https://www.lapa.ninja/lab/dev-space)\n\n## 50. Butterfly\n\n![Butterfly Landing Template](/images/uploads/butterfly.jpg)\n\nButterfly is a clean one page Bootstrap template perfect for startups wanting to feature a strong call to action and multiple informational pages. The template is retina-ready & fully responsive.\n\n[See the demo](https://bootstrapmade.com/demo/Butterfly/)",
  "title": "50 Free HTML Landing Page Templates [2020]",
  "short": "A comprehensive list of free HTML landing page templates.",
  "thumbnail": "/images/uploads/venus.jpg",
  "category": "Template"
}