{
  "date": "Wednesday April 8th, 2020",
  "dateshort": "April 8th",
  "title": "CSS Commenting",
  "description": "How to use comments effectively in CSS.",
  "short": "Learn how to use comments effectively in CSS.",
  "category": "CSS",
  "body": "A CSS *comment* is typically used to add additional notes to our code — which are not read by the browser.\n\nWe could also use comments to “comment out” a section of code, in order to prevent the browser from interpreting it.\n\nLet’s take a look!\n\n# The syntax\n\nWe can add a comment like so:\n\n```css\n/* This is a comment */\n```\n\nComments can be used in a single line, or over multiple lines. Until you add the closing `*/` token, the all the lines between are commented.\n\nFor example:\n\n```css\n/* A one-line comment */\n\n/*\nA \nmulti-\nline\ncomment\n*/\n\n/*\nspan {\n  display: block;\n  color: red;\n}\n*/\n```\n\nIf you have experience with other languages such as JavaScript, you’ll be familiar with inline commenting using `//`. CSS doesn’t have inline commenting! So if you add `//` before a rule like so:\n\n```css\n// Comment here\nspan {\n  display: block;\n  color: red;\n}\n```\n\nCSS will detect a syntax error and ignore your rule! So be sure to avoid this by using the `/* Comment */` syntax instead.\n\n## Using comments\n\nHow you choose to utilize comments is entirely up to you!\n\nYou could of course, use it to mark sections of code to be revised later, if for example you’ve implemented a hacky solution as a quick fix.\n\nHowever, the best use for commenting is to illustrate the page structure in your stylesheets. With a proper structure, comments make it easy to navigate and locate the sections in your page.\n\nFor example:\n\n```css\n/******************\n * UI Elements *\n ******************/\n\nh1, h2, h3, p {\n    ...\n}\n\n/******************\n * Header Section *\n ******************/\n\n#site-header {\n    ...\n}\n\n/******************\n * Footer Section *\n ******************/\n\n#site-footer {\n    ...\n}\n```\n\nBy breaking up your CSS into clear sections, its much easier to read. So when you need to come along and make a change at a later date — a clear structure makes for a much more pleasant process!\n\n\n\n## Related Posts:\n\n* [The Cascade, Inheritance & Specificity](https://www.easeout.co/blog/2020-03-18-css-the-cascade-inheritance-specificity)\n* [Basic Selectors](https://www.easeout.co/blog/2020-03-10-css-basic-selectors)"
}