{
  "date": "Thursday April 23rd, 2020",
  "dateshort": "April 23rd",
  "body": "In this tutorial, we’ll be learning about colors in CSS.\n\nWithout CSS, our web pages would look pretty dull. In HTML we get a plain white background, black text and blue links. And that’s about it.\n\nSo let’s use CSS to add some color!\n\n# Working with colors\n\nThe CSS `color` property sets the color of our text:\n\n```css\np {\n  color: lime;\n}\n```\n\nThe `color` property can accept any CSS color value. Which are categorized as: **named** colors, **hex** colors, **RGB & RGBa** colors or **HSL & HSLa** colors.\n\nLet’s take a look at each!\n\n### Named Colors\n\n```css\np {\n  color: lime;\n}\n```\n\nNamed colors (or keyword colors) are CSS keywords that define colors. Such as: red, blue, lime, aqua, lightcoral, etc.\n\nCSS originally started with 16 colors, however today there tons of options. Check out the [list of supported colors](https://www.w3schools.com/colors/colors_names.asp).\n\nNamed colors are great for convenience. However, to get more specific colors we should look at other options.\n\n### Hex Colors\n\nHex (or hexidecimal) colors, are defined with alphanumeric values.\n\nFor example:\n\n```css\np {\n  color: #00FFFF;\n}\n```\n\nEach hex color is expressed as a six-digit combination of numbers and letters defined by its mix of red, green and blue (RGB).\n\nIn the above example, the first two characters represent the red value, the second two the green value, and the third the blue value. The range is from 00 to FF.\n\nThe hex code is essentially shorthand for its RGB value!\n\nIn the case where our pairs of red, blue, and green values are all doubles, we can abbreviate the value to a 3 character shorthand. So #FFFFFF can be abbreviated to #FFF.\n\n```css\ncolor: #FFFFFF; /* white */\ncolor: #FFF;    /* also white! */\n```\n\n### RGB and RGBa Colors\n\nAlternatively, you can use `rgb()` to calculate a color from its RGB notation.\n\nTo define our colors, we use a comma-separated list of three numeric values (ranging from 0 to 255). The first represents the red value, the second is the green value, and the third is the blue value. For example:\n\n```css\ncolor: rgb(255, 255, 255);  /* white */\ncolor: rgb(0, 0, 0);        /* black */\ncolor: rgb(255, 0, 0);      /* red */\ncolor: rgb(34, 139, 34);    /* forest green*/\n```\n\nWe can use `rgba()` to adjust opacity. With RGBa we add a fourth value. The value is a number within a range from 0.0 (fully transparent) to 1 (fully opaque). For example:\n\n```css\np {\n  color: rgba(0, 255, 255, .5);\n}\n```\n\n### HSL and HSLa Colors\n\nHSL (Hue Saturation Lightness) colors are a more recent addition to CSS.\n\nAs with RGB we also use a comma-separated list of three values. The first is the degree of **Hue** (from 0 to 360), then a **Saturation** percentage (from 0% to 100%), and then a **Lightness** percentage (from 0% to 100%).\n\n```css\ncolor: hsl(0, 0%, 0%);    /* black */\ncolor: hsl(0, 0%, 100%);  /* white */\n```\n\nHSL colors are opaque by default.\n\nTo add opacity, use `hsla()` adding a fourth value ranging from 0.0 (fully transparent) to 1 (fully opaque).\n\n```css\ncolor: hsla(180, 100%, 50%, .5);\n```\n\n### Color accessibility\n\nWhen working with colors we should always mindful of accessibility. By ensuring the contrast ratio between the color of the text and the background meets a certain standard. This way people with vision considerations are still able to read the content of the page.\n\nThe ratio is determined by comparing the luminosity of the text and background color values. And we can compare colors with the Web Content Accessibility Guidelines (WCAG) [color checker](https://contrastchecker.com/) tool.\n\n### Wrapping up..\n\nAnd there you go! We’ve seen how to add color to our pages with named, HEX, RGB & HSL colors. Next up we’ll be looking at working with backgrounds in CSS. See you then!\n\n## Related posts:\n\n* [The CSS Box Model](https://www.easeout.co/blog/2020-04-14-the-css-box-model)",
  "title": "CSS Colors",
  "description": "Learn how to work with the different types of colors in CSS.",
  "short": "Learn how to work with the different types of colors in CSS.",
  "category": "CSS",
  "thumbnail": "/images/uploads/css-colors-min.png"
}