{
  "date": "Monday October 12th, 2020",
  "dateshort": "October 12th",
  "title": "20 Best Free SVG Editors & Resources",
  "short": "An awesome selection of free SVG tools for designers & developers.",
  "category": "Article",
  "thumbnail": "/images/uploads/bonsaithumb-min.png",
  "body": "In modern web development, the requirements for high-quality image presentation are becoming more and more necessary. Scalable vector graphics (SVG) give you exceptional image quality with natural scaling on various devices without affecting picture quality. It's no wonder that SVG is becoming the new normal in design and web development.\n\nWe’ve collected 25 of the best SVG editors and resources for designers & developers alike! Enjoy :)\n\n## SVG.js\n\n![SVG.JS Website](/images/uploads/svgjs.png)\n\nA lightweight library for manipulating and animating SVG.\n\nCheck out [SVG.js](https://svgjs.com/).\n\n## Inkscape\n\n![Inkscape Website](/images/uploads/inkscape.png)\n\nWhether you are an illustrator, designer, web designer or just someone who needs to create some vector imagery. Inkscape has powerful object creation and manipulation features such as pencil tools, stroke tools, rectangles, polygons, and more.\n\nCheck out [Inkscape](https://inkscape.org/).\n\n## Snap.svg\n\n![Snap SVG](/images/uploads/snapsvg.png)\n\nSVG is an excellent way to create interactive, resolution-independent vector graphics that will look great on any size screen. And the Snap.svg JavaScript library makes working with your SVG assets as easy as jQuery makes working with the DOM.\n\nDownload [Toybox](http://snapsvg.io/).\n\n## Raw\n\n![Raw webpage](/images/uploads/raw-svg-editor.jpg)\n\nRAW Graphs is an open source data visualization framework built with the goal of making the visual representation of complex data easy for everyone. If you need to visualize in SVG format, Raw has the capability to do it all for you.\n\nCheck out [Raw](https://rawgraphs.io/).\n\n## Trianglify\n\n![Trianglify Website](/images/uploads/trianglify.png)\n\nIf you want to create a simple polygonal texture background, you can use the Trianglify generator to create beautiful SVG geometric patterns. You can set the color, size, and color palette and download the SVG when your done!\n\nCheck out [Trianglify](https://trianglify.io/).\n\n## Plain Pattern\n\n![Plain Pattern Website](/images/uploads/plain-pattern.png)\n\nWith Plain Pattern, just upload your images, play with your intervals, rotate, or customize virtually anything, to get beautiful patterns quickly.\n\nCheck out [Plain Pattern](http://www.kennethcachia.com/plain-pattern/app/).\n\n## SVG Backgrounds\n\n![SVG Backgrounds Website](/images/uploads/svg-background-generator.png)\n\nSVG Backgrounds is a generator that gives you a ton of customizable vector illustrations.\n\nCheck out [SVG Backgrounds](https://www.svgbackgrounds.com/).\n\n## Flaticon\n\n![Flaticon Website](/images/uploads/flatcons.png)\n\nThe largest database of free icons available in PNG, SVG, EPS, PSD and BASE 64 formats. As of the time of writing, you can access 3,470,000 vector icons. Not to shabby!\n\nCheck out [Flaticon](flaticon.com).\n\n## Freepik\n\n![Freepik Website](/images/uploads/freepik.png)\n\nCSS peeper is visual version of the chrome developer tools. It's great for designers looking to quickly & easily inspect the CSS from a website. \n\nCheck out [Freepik](https://www.freepik.com/).\n\n## Method Draw\n\n![Method Draw Website](/images/uploads/method-draw-svg-tool.jpg)\n\nMethod Draw is yet another free online SVG editor. If you're looking for a no-fuss completely online solution - check it out!\n\nCheck out [Method Draw](https://editor.method.ac/).\n\n## Gravit Designer\n\n![Gravit Designer Website](/images/uploads/gravit-designer.jpg)\n\nWhether it is a complex graphic design or some simple icons, Gravit Designer gives you all the tools you'll need!\n\nCheck out [Gravit Designer](https://www.designer.io/en/).\n\n## Vecteezy\n\n![Vecteezy Website](/images/uploads/vecteezy.jpg)\n\nDesigned to allow anyone to customize Vecteezy content before they download it, or create beautiful vector designs from scratch directly in your browser.\n\nCheck out [Vecteezy](https://www.vecteezy.com/editor).\n\n## Vecta\n\n![Vecta Website](/images/uploads/vecta.jpg)\n\nCreating, using and sharing vector graphics has never been easier. Vecta is feature-rich and a great option for teams.\n\nCheck out [Vecta](https://vecta.io/).\n\n## Vectr\n\n![Vectr Website](/images/uploads/vectr.jpg)\n\nAt Vectr the philosophy is that everyone should experience the almost indescribable feeling that comes from expressing your creative freedom through art and design. Vectr is a beginner-friendly alternative that pros will find of great use, too.\n\nCheck out [Vectr](https://colorlib.com/wp/free-svg-editor-tools/).\n\n## SVG Morpheus\n\n![SVG Morpheus Website](/images/uploads/svgmorpheus.png)\n\nSVG Morpheus is a neat JavaScript library enabling SVG icons to morph from one to the other.\n\nCheck out [SVG Morpheus](https://alexk111.github.io/SVG-Morpheus/).\n\n## bonsai\n\n![Bonsai Website](/images/uploads/bonsai.png)\n\nBonsai is a graphics library with an intuitive API and an SVG renderer.\n\nCheck out [bonsai](http://bonsaijs.org/).\n\n## Glyphter\n\n![Glyphter Website](/images/uploads/glyphter.jpg)\n\nGlyphter gives you access to several different sources of SVG icons and fonts, which you can then use these to map out your very own SVG fonts sprite.\n\nCheck out [Glyphter](https://glyphter.com/).\n\n## SVGMagic\n\n![SVG Magic Website](/images/uploads/svgmagic.png)\n\nSVGMagic is a simple jQuery plugin that searches for SVG images (including background- and inline dataimages) on your website and creates PNG versions if the browser doesn't support SVG.\n\nCheck out [SVGMagic](http://dirkgroenen.nl/SVGMagic/).\n\n## Chartist.js\n\n![Chartist Website](/images/uploads/chartist.png)\n\nChartist helps you make dynamic & visually appealing charts that look and feel amazing on any device. Chartist’s goal is to provide a simple, lightweight and library to responsively craft charts on your website.\n\nCheck out [Chartist.js](https://gionkunz.github.io/chartist-js/).\n\n## Boxy SVG\n\n![Boxy SVG Website](/images/uploads/boxy-svg.png)\n\nBoxy SVG project goal is to create the best tool for editing SVG files. For beginners as well as for professional web designers and web developers. On any device and operating system.\n\nCheck out [Boxy SVG](https://boxy-svg.com/).\n\n## Related Posts:\n\n* [15 Best Chrome Extensions for Designers](https://www.easeout.co/blog/2020-07-02-15-best-chrome-extensions-for-designers)\n* [25 Top Neumorphism UI Design Examples](https://www.easeout.co/blog/2020-03-27-25-top-neumorphism-ui-design-examples)\n* [25 Dark Mode UI Design Examples](https://www.easeout.co/blog/2020-05-13-25-dark-mode-ui-design-examples)",
  "description": ""
}