{
  "date": "Tuesday December 27th, 2022",
  "dateshort": "December 27th",
  "title": "The basics of HTML",
  "short": "Learn how to get started with HTML.",
  "description": "Learn how to get started with HTML.",
  "category": "CSS",
  "body": "In this article, we will review the very basics of HTML. If you’re brand new to building websites, this tutorial will help you to get up and running!\n\n## What is HTML?\n\nHTML (Hyper Text Markup Language) is a standard markup language for creating web pages and web applications. It is used to structure and format content on the web and is the foundation of most websites.\n\n### A Simple HTML Document\n\n```\n<!DOCTYPE html>\n<html>\n<head>\n<title>Page Title</title>\n</head>\n<body>\n\n<h2>Heading Content</h2>\n<p>Paragraph Content</p>\n\n</body>\n</html>\n```\n\nThis can be explained as follows:\n\n![HTML element basics](/images/uploads/html-basic-format.png)\n\n**Note:** The content inside the <body> section will be displayed in a browser. The content inside the <title> element will be shown in the browser’s title bar or in the page’s tab.\n\n### What is an HTML Element?\n\nHTML is comprised of **elements**, each element is defined by a start tag, some content, then an end tag, like so:\n\n**<tag> Your content… </tag>**\n\nThe HTML **element** is everything from the start tag to the end tag, for example: \n\n```\n<h1>My First Heading</h1>\n<p>My first paragraph.</p>\n```\n\n### Web browsers display HTML pages\n\nThe purpose of a web browser (Chrome, Firefox, etc) is to read HTML documents and display them on the page.\n\nOf course, a browser does not display the HTML tags, but uses them to render the document:\n\n![HTML rendered in the browser](/images/uploads/html-example.png)\n\n### How can you create an HTML page?\n\nTo get started with HTML, you will need a text editor and a web browser. There are many options for both, but some popular choices include Notepad (for Windows) or TextEdit (for Mac) as a text editor, and Google Chrome or Mozilla Firefox as a web browser.\n\nTo create an HTML document, you will need to save your text file with the `.html` file extension. Then, you can start writing HTML code by enclosing your content in HTML tags. Use this code to create your first webpage!\n\n```\n<!DOCTYPE html>\n<html>\n<body>\n\n<h1>My First Heading</h1>\n<p>My first paragraph.</p>\n\n</body>\n</html>\n```\n\nTo view the HTML page in your web browser, simply open the HTML file from the file menu of your web browser.",
  "thumbnail": "/images/uploads/html-thumb-min.png"
}